tiborsimon/embedded-tdd-headers/pic/8bit/pic16f526_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F526_H_
#define _PIC16F526_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define PA0                           11
#define CWUF                          12
#define RBWUF                         13
#define FSR                           14
#define OSCCAL                        15
#define CAL0                          16
#define CAL                           17
#define CAL1                          18
#define CAL2                          19
#define CAL3                          20
#define CAL4                          21
#define CAL5                          22
#define CAL6                          23
#define PORTB                         24
#define RB0                           25
#define RB                            26
#define RB1                           27
#define RB2                           28
#define RB3                           29
#define RB4                           30
#define RB5                           31
#define PORTC                         32
#define RC0                           33
#define RC                            34
#define RC1                           35
#define RC2                           36
#define RC3                           37
#define RC4                           38
#define RC5                           39
#define CM1CON0                       40
#define nC1WU                         41
#define C1PREF                        42
#define C1NREF                        43
#define C1ON                          44
#define nC1T0CS                       45
#define C1POL                         46
#define nC1OUTEN                      47
#define C1OUT                         48
#define ADCON0                        49
#define ADON                          50
#define GO_nDONE                      51
#define NOT_DONE                      52
#define GO                            53
#define CHS                           54
#define CHS0                          55
#define CHS1                          56
#define ADCS0                         57
#define ADCS                          58
#define ADCS1                         59
#define ANS0                          60
#define ANS                           61
#define ANS1                          62
#define ADRES                         63
#define ADRES0                        64
#define ADRES1                        65
#define ADRES2                        66
#define ADRES3                        67
#define ADRES4                        68
#define ADRES5                        69
#define ADRES6                        70
#define ADRES7                        71
#define CM2CON0                       72
#define nC2WU                         73
#define C2PREF1                       74
#define C2NREF                        75
#define C2ON                          76
#define C2PREF2                       77
#define C2POL                         78
#define nC2OUTEN                      79
#define C2OUT                         80
#define VRCON                         81
#define VR0                           82
#define VR                            83
#define VR1                           84
#define VR2                           85
#define VR3                           86
#define VRR                           87
#define VROE                          88
#define VREN                          89
#define EECON                         90
#define RD                            91
#define WR                            92
#define WREN                          93
#define WRERR                         94
#define FREE                          95
#define EEDATA                        96
#define EEADR                         97

#endif // _PIC16F526_H_
